doc/setup/install-module.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-03 Tue 08:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>install-module.sh</title>
<meta name="author" content="Alex Ameen" />
<meta name="generator" content="Org Mode" />

<meta http-equiv='X-UA-Compatible' content='IE=edge'>
<meta content='width=device-width, initial-scale=1, maximum-scale=1,
               user-scalable=no'
      name='viewport'>
</head>
<body>
<div id="content" class="content">
<h1 class="title">install-module.sh</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9753fde">1. NAME</a></li>
<li><a href="#org02139d6">2. DESCRIPTION</a></li>
<li><a href="#orgdc436c7">3. ENVIRONMENT</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9753fde" class="outline-2">
<h2 id="org9753fde"><span class="section-number-2">1.</span> NAME</h2>
<div class="outline-text-2" id="text-1">
<p>
install-module.sh - manual page for install-module.sh 0.1.0
</p>
</div>
</div>

<div id="outline-container-org02139d6" class="outline-2">
<h2 id="org02139d6"><span class="section-number-2">2.</span> DESCRIPTION</h2>
<div class="outline-text-2" id="text-2">
<p>
install-module.sh [OPTIONS] FROM NM-DIR
</p>

<p>
Module rooted at <code>FROM</code> ( as <code>FROM/package.json</code> ), will be installed to
<code>NM-DIR/&lt;NAME&gt;</code> symlinking any executables to <code>NM-DIR/.bin</code>.
</p>

<p>
OPTIONS
</p>

<dl class="org-dl">
<dt><b>-t</b>,&#x2013;to</dt><dd>Treat <code>NM-DIR</code> as literal install dir</dd>

<dt><b>-i</b>,&#x2013;ident ID</dt><dd>Treat <code>ID</code> as the package identifier/name</dd>

<dt><b>-b</b>,&#x2013;bins</dt><dd>Force processing of bins</dd>

<dt><b>-B</b>,&#x2013;no-bins</dt><dd>Skip processing bins</dd>

<dt><b>-p</b>,&#x2013;perms</dt><dd>Force fixing of <code>FROM</code> permissions for dirs and bins</dd>

<dt><b>-P</b>,&#x2013;no-perms</dt><dd>Skip checking of <code>FROM</code> permissions, copy them &ldquo;as
is&rdquo;</dd>

<dt><b>-s</b>,&#x2013;patch</dt><dd>Force patching shebangs</dd>

<dt><b>-S</b>,&#x2013;no-patch</dt><dd>Skip patching shebangs</dd>

<dt><b>-l</b>,&#x2013;bin-links</dt><dd>Force creation of executable symlinks</dd>

<dt><b>-L</b>,&#x2013;no-bin-links</dt><dd>Skip creation of executable symlinks</dd>

<dt><b>-u</b>,&#x2013;usage</dt><dd>Print usage message to STDOUT</dd>

<dt><b>-h</b>,&#x2013;help</dt><dd>Print this message to STDOUT</dd>

<dt><b>-V</b>,&#x2013;version</dt><dd>Print version to STDOUT</dd>
</dl>
</div>
</div>

<div id="outline-container-orgdc436c7" class="outline-2">
<h2 id="orgdc436c7"><span class="section-number-2">3.</span> ENVIRONMENT</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
The following environment variables may be used unless explicitly
overridden by options/flags mentioned above. These variables are not
required, but may be used as an optimization to skip reading the
contents of <code>package.json</code>.
</p>

<p>
Variables marked as &ldquo;Bool&rdquo; are treated as false when unset or set to
the empty string, or true for any non-empty value. Flags will always
take priority over environment variables.
</p>
</blockquote>

<dl class="org-dl">
<dt><code>IDENT</code></dt><dd>Treat <code>IDENT</code> as the package identifier/name.</dd>

<dt><code>NO_BINS</code></dt><dd>Skip processing of bins if non-empty. ( Bool )</dd>

<dt><code>BIN_PAIRS</code></dt><dd>Space separated tuples of executables to be installed as:
<code>BIN-NAME,REL-PATH BIN-NAME2,REL-PATH...</code></dd>

<dt><code>BIN_DIR</code></dt><dd>Relative path to directory containing scripts to be
installed as executables ( drops any extension for exposed bin ). This
variable is ignored if <code>BIN_PAIRS</code> is non-empty.</dd>

<dt><code>NO_BIN_LINKS</code></dt><dd>Skip creation of executable symlinks. ( Bool )</dd>

<dt><code>NO_PERMS</code></dt><dd>Skip checking/fixup of directory and executable
permissions when non-empty. ( Bool )</dd>

<dt><code>NO_PATCH</code></dt><dd>Skip patching shebangs in scripts when non-empty. ( Bool )</dd>

<dt><code>NODEJS</code></dt><dd>Absolute path to <code>node</code> executable. May be omitted if
patching shebangs is disabled.</dd>

<dt><code>JQ</code></dt><dd>Absolute path to <code>jq</code> executable. May be omitted if <code>IDENT</code> is
known and any <code>*BIN*</code> variable is is non-empty ( it is only needed to
read <code>package.json</code> ).</dd>

<dt><code>ID</code></dt><dd>Absolute path to <code>id</code> executable.</dd>

<dt><code>CHMOD</code></dt><dd>Absolute path to <code>chmod</code> executable.</dd>

<dt><code>CHOWN</code></dt><dd>Absolute path to <code>chown</code> executable.</dd>

<dt><code>MKDIR</code></dt><dd>Absolute path to <code>mkdir</code> executable.</dd>

<dt><code>CP</code></dt><dd>Absolute path to <code>cp</code> executable. This is useful for adding
additional flags or wrapping the program used to copy files.</dd>

<dt><code>LN</code></dt><dd>Absolute path to <code>ln</code> executable.</dd>

<dt><code>REALPATH</code></dt><dd>Absolute path to <code>realpath</code> executable.</dd>

<dt><code>FIND</code></dt><dd>Absolute path to <code>find</code> executable.</dd>

<dt><code>BASH</code></dt><dd>Absolute path to <code>bash</code> executable.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Ameen</p>
<p class="date">Created: 2023-01-03 Tue 08:53</p>
</div>
</body>
</html>
